function GEN_GEOMETRIES_OF_ALL_TYPES() {
    var center = new maptalks.Coordinate(118.846825, 32.046534);
    var w = 200, h = 200, r = 200;
    return [
        new maptalks.Marker(center),
        new maptalks.Label('■■■■■■■■■', center),
        new maptalks.TextBox('test textbox', center, 100, 50),
        new maptalks.Circle(center, r),
        new maptalks.Ellipse(center, w, h),
        new maptalks.Rectangle(center, w, h),
        new maptalks.Sector(center, r, 90, 180),
        new maptalks.LineString([
            { x: 121.111, y: 30.111 },
            { x: 121.222, y: 30.222 }
        ]),
        new maptalks.ArcCurve(
            //线端点坐标数组
            [[121.48416288620015, 31.24488412311837], [121.48394830947899, 31.242664302121515], [121.48595460182202, 31.242535881128543], [121.48695238357557, 31.244838259576046], [121.48944147354125, 31.24487495041167], [121.49018176322932, 31.242664302121515], [121.49290688758839, 31.242765204207824], [121.49358280426011, 31.245040058995645], [121.49601825004554, 31.245159303904526], [121.49715550666777, 31.242921143583686]],
            //bezierCurveDegree指贝塞尔曲线的度, 取值为2或者3即二阶贝塞尔曲线或三阶贝塞尔曲线
            { arcDegree: 120, arrowStyle: 'classic', arrowPlacement: 'point' }),
        new maptalks.QuadBezierCurve(
            //线端点坐标数组
            [[121.48416288620015, 31.24488412311837], [121.48394830947899, 31.242664302121515], [121.48595460182202, 31.242535881128543], [121.48695238357557, 31.244838259576046], [121.48944147354125, 31.24487495041167], [121.49018176322932, 31.242664302121515], [121.49290688758839, 31.242765204207824], [121.49358280426011, 31.245040058995645], [121.49601825004554, 31.245159303904526], [121.49715550666777, 31.242921143583686]],
            //bezierCurveDegree指贝塞尔曲线的度, 取值为2或者3即二阶贝塞尔曲线或三阶贝塞尔曲线
            { arrowStyle: 'classic', arrowPlacement: 'point' }),
        new maptalks.CubicBezierCurve(
            //线端点坐标数组
            [[121.48416288620015, 31.24488412311837], [121.48394830947899, 31.242664302121515], [121.48595460182202, 31.242535881128543], [121.48695238357557, 31.244838259576046], [121.48944147354125, 31.24487495041167], [121.49018176322932, 31.242664302121515], [121.49290688758839, 31.242765204207824], [121.49358280426011, 31.245040058995645], [121.49601825004554, 31.245159303904526], [121.49715550666777, 31.242921143583686]],
            //bezierCurveDegree指贝塞尔曲线的度, 取值为2或者3即二阶贝塞尔曲线或三阶贝塞尔曲线
            { arrowStyle: 'classic', arrowPlacement: 'point' }),
        new maptalks.Polygon([
            [
                { x: 121.111, y: 30.111 },
                { x: 122.222, y: 30.111 },
                { x: 122.222, y: 30.333 },
                { x: 121.111, y: 30.333 }
            ]
        ]),
        new maptalks.MultiLineString([
            [
                { x: 121.111, y: 30.111 },
                { x: 121.222, y: 30.222 }
            ],
            [
                { x: 121.333, y: 30.333 },
                { x: 121.444, y: 30.444 }
            ]
        ]),
        new maptalks.MultiPolygon([
            [
                [
                    { x: 121.111, y: 30.111 },
                    { x: 121.222, y: 30.222 },
                    { x: 121.333, y: 30.333 }
                ]
            ],
            [
                [
                    { x: 121.444, y: 30.444 },
                    { x: 121.555, y: 30.555 },
                    { x: 121.666, y: 30.666 }
                ]
            ]
        ])
    ];
    // return geometries;
}